<h1> Инструкция по настройке рабочего пространства для комфортного обучения на курсе </h1>

<h2> Установка PHP </h2>

<ol>
<li><p><a href="https://windows.php.net/download#php-7.2">Скачать</a> архив (Zip)</p>

    <p>x86 — версия для 32-битной ОС, x64 — 64-битная версия. Из Thread Safe и Non Thread Safe выбираем Thread Safe (c поддержкой многопоточности).</p>
    <p><img src="img/inst_php.png" alt="" width="50%" height="80%"></p>
</li>
<li>Чтобы установить PHP, просто распакуй скачанный архив в какую нибудь папку без пробелов в имени, например C:\PHP</li>
<p>Как должно выглядеть: <br>  <br>  <img src="img/php_on_C.png" alt="" width="50%" height="80%"></p>
<li>Добавить путь к этой папке в переменную окружения Path. Для этого:</li>
    <ul>
        <li>Открываем Панель управления->Система->Дополнительные параметры системы->Переменные среды <br> <br><img src="img/path.gif" width="50%" alt=""></li>
        <li>Выбераем переменную Path и нажимаем Изменить <br> <img src="img/path_2.png" alt=""></li>
        <li>И создаем путь к нашему распакованному архиву <br> <img src="img/add_path.gif" width="50%"  alt=""></li>
    </ul>

    <li>Проверяем все ли правильно сделали:</li>
    <ul>
        <li>Открываем Командную строку</li>
        <li>Прописываем php -v</li>
    </ul>
    <p><img src="img/check.gif" width="50%"  alt=""></p>


</ol>
